# Rebar Crank Overridable Parameters Get Crank Start Length Formula Params Method

Source: https://www.revitapidocs.com/2026/dcfdeff5-80d3-4bbc-7d9a-705a0c0d0741.htm

---

| Rebar Crank Overridable Parameters Get Crank Start Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankStartLengthFormulaParams()
```

```
Public Function GetCrankStartLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankStartLengthFormulaParams()
```

```
member GetCrankStartLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace